# StructuralSectionIweldedTopflangewidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIweldedTopflangewidth Property
ParameterTypeId Class See Also
---
"Top Flange Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIweldedTopflangewidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIweldedTopflangewidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIweldedTopflangewidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace